rico001/bambuddy-screen-4848S040CI-esp32/src/main.cpp
#include <Arduino.h>
#include <esp32_smartdisplay.h>
#include <esp_heap_caps.h>
#include <esp_system.h>
#include <esp_task_wdt.h>

#include "ams_screen.h"
#include "bambuddy_api.h"
#include "archive_screen.h"
#include "bambuddy_config.h"
#include "general_screen.h"
#include "queue_screen.h"
#include "settings_screen.h"
#include "screenshot.h"
#include "status_bar.h"
#include "status_screen.h"
#include "bambuddy_hms.h"
#include "hms_screen.h"
#include "nav_bar.h"
#include "ui_fullscreen.h"
#include "ui_kit.h"
#include "ui_layout.h"
#include "ui_nav.h"
#include "ui_theme.h"
#include "ui_watch.h"
#include "wifi_screen.h"

// --- Globals ---
static lv_obj_t *tileview;
static lv_obj_t *ams_tile;
static lv_obj_t *status_tile;
static lv_obj_t *queue_tile;
static lv_obj_t *archive_tile;
static lv_obj_t *general_tile;

static volatile int active_tile = -1;

// Die Kacheln in der Reihenfolge der Navigationsleiste: 0 = AMS ... 4 =
// System. Diese Reihenfolge ist die eine Wahrheit — Leiste, Sprungziele und
// die Webseite des Geraets zaehlen alle danach.
static lv_obj_t *tile_at(int index)
{
    lv_obj_t *const tiles[NAV_TILE_COUNT] = {ams_tile, status_tile, queue_tile,
                                             archive_tile, general_tile};
    if (index < 0 || index >= NAV_TILE_COUNT) return nullptr;
    return tiles[index];
}

static int tile_index(const lv_obj_t *tile)
{
    if (!tile) return -1;
    for (int i = 0; i < NAV_TILE_COUNT; i++)
        if (tile_at(i) == tile) return i;
    return -1;
}

// Kachelwechsel: nur der sichtbare Screen soll Daten holen
static void tile_changed_cb(lv_event_t *)
{
    lv_obj_t *const active = lv_tileview_get_tile_active(tileview);

    ams_screen_set_visible(active == ams_tile);
    queue_screen_set_visible(active == queue_tile);
    archive_screen_set_visible(active == archive_tile);
    general_screen_set_visible(active == general_tile);

    // Die Leiste muss auch dem Wischen folgen, nicht nur dem Antippen —
    // sonst zeigt sie nach einer Geste noch auf die vorherige Kachel. Der
    // Index wird zugleich vermerkt, damit die Webseite des Geraets zeigen
    // kann, wo es steht, ohne LVGL aus einem fremden Task anzufassen.
    const int index = tile_index(active);
    if (index >= 0) nav_bar_set_active(index);
    active_tile = index;
}

int ui_nav_active_tile()
{
    return active_tile;
}

void ui_nav_tile(int index)
{
    lv_obj_t *const tile = tile_at(index);
    if (!tileview || !tile) return;

    lv_tileview_set_tile(tileview, tile, LV_ANIM_OFF);
    tile_changed_cb(nullptr);
}

// Aus fremdem Task gesetzt, im LVGL-Thread abgeholt. Ein einzelner int
// braucht dafuer kein Schloss: Nur der eine Weg schreibt, nur der andere
// setzt zurueck. Kommen zwei Wuensche kurz nacheinander, gewinnt der
// spaetere — genau das erwartet auch, wer zweimal klickt.
static volatile int wanted_tile = -1;

void ui_nav_tile_from_task(int index)
{
    wanted_tile = index;
}

void ui_nav_poll()
{
    const int index = wanted_tile;
    if (index < 0) return;
    wanted_tile = -1;
    ui_nav_tile(index);
}

// Smart Plugs und Jog-Steuerung liegen als Vollbild ueber allem. Ein
// Kachelwechsel ist dafuer nicht mehr noetig — und auch nicht mehr richtig:
// Der Zurueck-Knopf soll dorthin zurueckfuehren, wo man war, nicht auf die
// Systemkachel, die man nie aufgesucht hat.
void ui_nav_smart_plugs()
{
    general_screen_show_smart_plugs();
}

void ui_nav_jog()
{
    general_screen_show_jog();
}

void ui_nav_messages()
{
    ui_fullscreen_open("Meldungen", COL_NEUTRAL, hms_screen_create, hms_screen_destroy);
}


// Beim Start sagen, warum zuletzt neu gestartet wurde. Ohne diese Zeile
// bleibt nach einem unbeobachteten Reset nur Raten: Absturz, Watchdog und
// Spannungseinbruch sehen im Nachhinein identisch aus.
// Liefert den Grund im Klartext und sagt, ob er unerwartet war. Beides
// landet auch im Meldungsprotokoll: Ein Neustart um drei Uhr nachts ist eine
// Information, die man am naechsten Morgen sucht.
static const char *reset_reason_text(bool *unexpected)
{
    const char *text;
    *unexpected = false;

    switch (esp_reset_reason()) {
    case ESP_RST_POWERON:  text = "Einschalten"; break;
    case ESP_RST_SW:       text = "Neustart durch Software"; break;
    case ESP_RST_PANIC:    text = "ABSTURZ (Exception/Panic)"; *unexpected = true; break;
    case ESP_RST_TASK_WDT: text = "Task-Watchdog: ein Task hat blockiert"; *unexpected = true; break;
    case ESP_RST_INT_WDT:  text = "Interrupt-Watchdog"; *unexpected = true; break;
    case ESP_RST_WDT:      text = "sonstiger Watchdog"; *unexpected = true; break;
    case ESP_RST_BROWNOUT: text = "SPANNUNGSEINBRUCH (Netzteil/USB-Kabel)"; *unexpected = true; break;
    case ESP_RST_DEEPSLEEP:text = "Aufwachen aus Deep Sleep"; break;
    case ESP_RST_EXT:      text = "Reset-Pin"; break;
    default:               text = "unbekannt"; break;
    }
    return text;
}

// --- Setup & Loop ---
auto lv_last_tick = millis();

// Nach dem Aufbau einmal zeigen, wie es um den Speicher steht: der LVGL-Pool
// und der interne RAM sind die beiden Groessen, an denen dieses Board haengt.
static void log_memory(const char *stage)
{
    // LVGL benutzt jetzt den System-Heap, hat also keinen eigenen Pool mehr,
    // ueber den sich berichten liesse. Entscheidend ist ohnehin der interne
    // RAM: an ihm haengen Sockets, Task-Stacks und die Zeichenpuffer.
    Serial.printf("[Speicher] %s — intern frei %u, groesster Block %u, "
                  "PSRAM frei %u\n",
                  stage,
                  (unsigned)heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT),
                  (unsigned)heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT),
                  (unsigned)heap_caps_get_free_size(MALLOC_CAP_SPIRAM));
}

void setup()
{
    Serial.begin(115200);
    delay(200); // kurz warten, sonst verschluckt der Monitor die erste Zeile

    bool unexpected_restart = false;
    const char *restart_reason = reset_reason_text(&unexpected_restart);
    Serial.printf("\n[Start] Letzter Neustart: %s\n", restart_reason);

    smartdisplay_init();

    // Theme vor dem Bau der Screens setzen, sonst blitzt kurz das falsche auf
    settings_apply_saved();
    bambuddy_config_load();

    // Erst hier, nicht ganz oben: Das Protokoll liegt im NVS, und der ist
    // nach smartdisplay_init() und dem Laden der Einstellungen bereit.
    bambuddy_hms_report_boot(restart_reason, unexpected_restart);

    // Statusleiste liegt fest oben, die Screens darunter
    status_bar_create(lv_screen_active());

    // Tileview for swipeable screens (horizontal)
    tileview = lv_tileview_create(lv_screen_active());
    lv_obj_set_size(tileview, SCREEN_W, CONTENT_H);
    lv_obj_align(tileview, LV_ALIGN_TOP_MID, 0, STATUS_BAR_H);
    lv_obj_set_style_border_width(tileview, 0, 0);
    lv_obj_set_style_radius(tileview, 0, 0);
    // Kein Rollbalken am unteren Rand: Welche Kachel offen ist, sagt jetzt
    // die Navigationsleiste — der Balken haette dieselbe Auskunft ein
    // zweites Mal gegeben, direkt darueber.
    lv_obj_set_scrollbar_mode(tileview, LV_SCROLLBAR_MODE_OFF);

    // Grundflaeche des ganzen Geraets. Ohne diese Zeile setzt das Theme von
    // LVGL seinen eigenen Grauton, und die Karten der Screens schwimmen
    // darauf statt sich abzuheben.
    ui_screen_surface(lv_screen_active());
    ui_screen_surface(tileview);

    lv_obj_t *tile1 = lv_tileview_add_tile(tileview, 0, 0, (lv_dir_t)LV_DIR_RIGHT);
    lv_obj_t *tile2 = lv_tileview_add_tile(tileview, 1, 0, (lv_dir_t)(LV_DIR_LEFT | LV_DIR_RIGHT));
    lv_obj_t *tile3 = lv_tileview_add_tile(tileview, 2, 0, (lv_dir_t)(LV_DIR_LEFT | LV_DIR_RIGHT));
    lv_obj_t *tile4 = lv_tileview_add_tile(tileview, 3, 0, (lv_dir_t)(LV_DIR_LEFT | LV_DIR_RIGHT));
    lv_obj_t *tile5 = lv_tileview_add_tile(tileview, 4, 0, (lv_dir_t)LV_DIR_LEFT);

    // AMS liegt links vom Druckerstatus. Der Status bleibt die Startkachel,
    // rechts folgen Warteschlange, Archiv und System.
    lv_obj_t *const tiles[] = {tile1, tile2, tile3, tile4, tile5};
    for (lv_obj_t *tile : tiles) ui_screen_surface(tile);

    ams_screen_create(tile1);
    status_screen_create(tile2);
    queue_screen_create(tile3);
    archive_screen_create(tile4);
    general_screen_create(tile5);
    lv_tileview_set_tile(tileview, tile2, LV_ANIM_OFF);

    // Daten-Screens und die dynamische Systemansicht bekommen ihre
    // Sichtbarkeit ueber den Tilewechsel gemeldet.
    ams_tile = tile1;
    status_tile = tile2;
    queue_tile = tile3;
    archive_tile = tile4;
    general_tile = tile5;
    lv_obj_add_event_cb(tileview, tile_changed_cb, LV_EVENT_VALUE_CHANGED, nullptr);

    // Nach dem Tileview angelegt, damit die Leiste darueber liegt und von
    // einer Wischgeste auf der Kachel nicht verdeckt wird.
    nav_bar_create(lv_screen_active());
    nav_bar_set_active(1); // Startkachel ist der Status

    log_memory("Screens gebaut");

    wifi_service_start();
    bambuddy_api_start();

    log_memory("Netzwerk-Task gestartet");

    // Den UI-Thread ueberwachen. Bleibt lv_timer_handler laenger als zehn
    // Sekunden haengen, erzwingt der Watchdog einen Panic mit Backtrace —
    // damit wird aus einem stummen Freeze eine Zeilennummer. Zehn Sekunden
    // sind reichlich: ein voller Bildaufbau dauert Millisekunden.
    esp_task_wdt_init(10, true);
    esp_task_wdt_add(nullptr);
}

void loop()
{
    auto const now = millis();
    lv_tick_inc(now - lv_last_tick);
    lv_last_tick = now;
    ui_watch_alive_ms = now;
    ui_watch("lvgl");
    lv_timer_handler();
    ui_watch("loop");

    // Beides muss hier geschehen, weil nur dieser Thread an LVGL darf. Erst
    // umschalten, dann aufnehmen: Wer von der Webseite aus eine Kachel
    // waehlt und gleich danach ein Bild abruft, soll die neue sehen.
    ui_nav_poll();
    screenshot_poll();
    esp_task_wdt_reset();

    // Gibt dem WiFi/TCP-Task auf Core 0 CPU-Zeit — ohne yield kann der
    // WiFi-Stack Pakete verpassen, wenn LVGL-Rendering Core 1 blockiert.
    delay(1);
}
